# Usage:
# ln -s dotfiles/Brewfile-<profile> $HOME/.Brewfile
# brew bundle --global

# Shell + utils
brew 'autojump'
brew 'curl'
brew 'ffmpeg'
brew 'gpg'
brew 'htop'
brew 'imagemagick'
cask 'iterm2'
brew 'jsonpp'
brew 'keychain'
brew 'multitail'
brew 'openssl'
cask 'rar'
brew 'ripgrep'
brew 'screen'
brew 'speedtest-cli'
brew 'telnet'
brew 'the_silver_searcher'
brew 'tree'
brew 'youtube-dl'
brew 'watch'
brew 'wget'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Applications
cask 'alfred'
cask 'cyberduck'
cask 'firefox'
cask 'easyfind'
cask 'fliqlo'
cask 'istat-menus'
cask 'iina'
cask 'inkscape'
cask 'jdiskreport'
cask 'slack'
cask 'the-unarchiver'
cask 'tor-browser'
cask 'adobe-acrobat-reader'
cask 'transmission'
mas "Things 3", id: 904280696

# Editors
# cask 'sublime-text'
brew 'vim'

# Development
brew 'git'
#brew 'python'

cask 'ultimaker-cura'

