# Usage:
# ln -s dotfiles/Brewfile $HOME/.Brewfile
# brew bundle --global

tap 'caskroom/cask'
tap 'caskroom/versions'

# Shell + utils
brew 'autojump'
brew 'awscli'
brew 'awslogs'
brew 'curl'
brew 'gpg'
brew 'htop'
cask 'iterm2'
brew 'openssl'
brew 'screen'
brew 'speedtest-cli'
brew 'telnet'
brew 'the_silver_searcher'
brew 'tree'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Applications
cask '1password'
cask 'alfred'
cask 'firefox-developer-edition'
cask 'easyfind'
cask 'fliqlo'
cask 'google-chrome'
cask 'istat-menus5'
cask 'iina'
cask 'jdiskreport'
cask 'keybase'
cask 'slack'
cask 'the-unarchiver'
mas "Things 3", id: 904280696

# Editors
cask 'sublime-text'
brew 'vim'

# Development
brew 'bower'
#cask 'chef/chef/chefdk'
cask 'dash'
cask 'docker'
brew 'git'
brew 'gradle'
brew 'grunt'
cask 'intellij-idea-ce'
brew 'jenv'
cask 'java'
cask 'java8'
brew 'maven'
brew 'mysql'
cask 'mysqlworkbench'
brew 'npm'
brew 'packer'
brew 'python'
brew 'yarn'
cask 'virtualbox'
cask 'vagrant'
brew 'webpack'
#mas "Xcode", id: 497799835
