# Usage:
# ln -s dotfiles/Brewfile $HOME/.Brewfile
# brew bundle --global

tap 'caskroom/cask'
tap 'caskroom/versions'

# Shell + utils

brew 'autojump'
brew 'awscli'
brew 'awslogs'
brew 'curl'
brew 'gpg'
brew 'htop'
cask 'iterm2'
brew 'openssl'
brew 'screen'
brew 'speedtest-cli'
brew 'the_silver_searcher'
brew 'tree'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Applications
cask '1password'
cask 'alfred'
cask 'betterzip'
cask 'caskroom/versions/firefox-developer-edition'
cask 'fliqlo'
cask 'google-chrome'
cask 'istat-menus5'
cask 'jdiskreport'
cask 'keybase'
cask 'slack'

# Editors
cask 'sublime-text'
brew 'vim'

# Development
cask 'chefdk'
cask 'dash'
brew 'git'
brew 'gradle'
cask 'intellij-idea-ce'
brew 'jenv'
#cask 'java'
cask 'java8'
brew 'maven'
brew 'packer'
brew 'python'
cask 'virtualbox'
cask 'vagrant'